spec/support/rails_app/app/controllers/discounts_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 10]]
---
  def set_event
    @event = Event.find(params[:event_id])